{
  "books": [
    {
      "id": 1,
      "title": "The Great Gatsby",
      "genre": "Fiction",
      "date": "1925-04-10",
      "bookImg": "https://www.hachettebookgroup.com/wp-content/uploads/2020/06/9780762498130-3.jpg?w=640",
      "authorName": "F. Scott Fitzgerald"
    },
    {
      "id": 2,
      "title": "To Kill a Mockingbird",
      "genre": "Classic",
      "date": "1960-07-11",
      "bookImg": "https://m.media-amazon.com/images/I/81aY1lxk+9L._AC_UF1000,1000_QL80_.jpg",
      "authorName": "Harper Lee"
    },
    {
      "id": 3,
      "title": "1984",
      "genre": "Dystopian",
      "date": "1949-06-08",
      "bookImg": "https://example.com/images/1984.jpg",
      "authorName": "George Orwell"
    },
    {
      "id": 4,
      "title": "The Hobbit",
      "genre": "Fantasy",
      "date": "1937-09-21",
      "bookImg": "https://m.media-amazon.com/images/I/712cDO7d73L._AC_UF1000,1000_QL80_.jpg",
      "authorName": "J.R.R. Tolkien"
    },
    {
      "id": 5,
      "title": "Pride and Prejudice",
      "genre": "Classic",
      "date": "1813-01-28",
      "bookImg": "https://example.com/images/pride_and_prejudice.jpg",
      "authorName": "Jane Austen"
    },
    {
      "id": 6,
      "title": "The Catcher in the Rye",
      "genre": "Fiction",
      "date": "1951-07-16",
      "bookImg": "https://example.com/images/the_catcher_in_the_rye.jpg",
      "authorName": "J.D. Salinger"
    },
    {
      "id": 7,
      "title": "Harry Potter and the Sorcerer's Stone",
      "genre": "Fantasy",
      "date": "1997-06-26",
      "bookImg": "https://example.com/images/harry_potter.jpg",
      "authorName": "J.K. Rowling"
    },
    {
      "id": 8,
      "title": "The Lord of the Rings",
      "genre": "Fantasy",
      "date": "1954-07-29",
      "bookImg": "https://s26162.pcdn.co/wp-content/uploads/2017/05/the-lord-of-the-rings-book-cover.jpg",
      "authorName": "J.R.R. Tolkien"
    },
    {
      "id": 9,
      "title": "The Shining",
      "genre": "Horror",
      "date": "1977-01-28",
      "bookImg": "https://example.com/images/the_shining.jpg",
      "authorName": "Stephen King"
    },
    {
      "id": 10,
      "title": "The Hunger Games",
      "genre": "Dystopian",
      "date": "2008-09-14",
      "bookImg": "https://m.media-amazon.com/images/I/71un2hI4mcL._AC_UF1000,1000_QL80_.jpg",
      "authorName": "Suzanne Collins"
    }
  ],
  "posts": [
    {
      "title": "Unveiling the Jazz Age Splendor: My Impressions of \"The Great Gatsby\"",
      "body": "Greetings, fellow readers! Today, I find myself enchanted by the glitz and glamour of the Roaring Twenties as I reflect on F. Scott Fitzgerald's masterwork, \"The Great Gatsby.\" Join me on a journey through the opulent world of Jay Gatsby, where love, wealth, and longing collide in a whirlwind of tragedy and triumph.\n\n\"The Great Gatsby\" is a tale of lost illusions and the pursuit of the American Dream, set against the backdrop of the glittering Long Island sound. From the moment we meet the enigmatic Jay Gatsby, standing alone on the shores of West Egg, we are drawn into a world of excess and extravagance.\n\nOne aspect of the novel that struck me deeply is Fitzgerald's exquisite prose, which sparkles like the champagne flutes at Gatsby's lavish parties. With every turn of the page, I was swept away by the lush descriptions of Gatsby's mansion, the shimmering lights of New York City, and the haunting green light at the end of Daisy Buchanan's dock.\n\nBut beneath the surface of wealth and glamour lies a story of unfulfilled desires and shattered dreams. Through the eyes of narrator Nick Carraway, we witness the tragic downfall of Gatsby, a man who rose from humble origins to become a symbol of the American Dream, only to lose everything in pursuit of a love that was never meant to be.\n\nYet amidst the heartache and disillusionment, there is a haunting beauty to be found in Fitzgerald's portrayal of love and longing. From Gatsby's undying devotion to Daisy to the poignant moments of quiet reflection, \"The Great Gatsby\" reminds us that even in a world of glittering parties and extravagant gestures, the truest riches are found in the depths of the human heart.\n\nAs I reluctantly bid farewell to Gatsby and his tragic tale, I am left with a sense of awe and admiration for Fitzgerald's timeless masterpiece. \"The Great Gatsby\" is more than just a novel; it's a window into a bygone era, where every word is a brushstroke on the canvas of history.\n\nSo to all fellow readers who have yet to experience the splendor of \"The Great Gatsby,\" I urge you to step into the dazzling world of Jay Gatsby and Daisy Buchanan. Whether you're a hopeless romantic or a keen observer of human nature, \"The Great Gatsby\" promises to enchant and captivate, leaving an indelible mark on your soul.\n\nUntil next time, may your hearts be filled with the echoes of jazz and your dreams reach ever higher.\n\nCheers to the magic of literature!",
      "likes": 0,
      "bookId": 1,
      "userId": 1,
      "id": 1
    },
    {
      "title": "In the Footsteps of Atticus Finch: My Reflections on \"To Kill a Mockingbird\"",
      "body": "Greetings, fellow bookworms! Today, I'm transported to the sleepy town of Maycomb, Alabama, as I ponder the timeless themes and profound insights of Harper Lee's \"To Kill a Mockingbird.\" Join me on a journey through the pages of this Pulitzer Prize-winning novel, where courage, compassion, and the pursuit of justice reign supreme.\n\nSet against the backdrop of the Deep South in the 1930s, \"To Kill a Mockingbird\" follows the journey of young Scout Finch as she navigates the complexities of racial injustice and moral integrity in her community. Through Scout's innocent yet perceptive eyes, we witness the harsh realities of prejudice and discrimination, as well as the enduring power of empathy and compassion.\n\nOne aspect of the novel that resonated deeply with me is Harper Lee's remarkable ability to capture the essence of small-town life in the American South. From the sweltering heat of summer to the hushed whispers of gossip on the courthouse steps, every detail feels authentic and immersive, inviting readers to step into the world of Maycomb and experience its joys and sorrows firsthand.\n\nBut beyond its vivid setting and compelling characters, \"To Kill a Mockingbird\" is a poignant meditation on the nature of justice and the importance of standing up for what is right, even in the face of overwhelming odds. Through the character of Atticus Finch, we are reminded of the profound impact that a single individual can have on their community, simply by staying true to their principles and upholding the values of fairness and equality.\n\nAs I reluctantly bid farewell to Scout, Atticus, and the unforgettable cast of characters who inhabit the pages of \"To Kill a Mockingbird,\" I am left with a renewed sense of hope and optimism for the future. Despite the injustices and hardships that they face, the residents of Maycomb demonstrate resilience and courage in the face of adversity, inspiring readers to believe in the power of compassion and empathy to create positive change in the world.\n\nSo to all fellow readers who have yet to embark on this literary journey, I urge you to pick up a copy of \"To Kill a Mockingbird\" and discover for yourself the timeless wisdom and profound truths that lie within its pages. Whether you're a seasoned reader or a newcomer to the world of literature, \"To Kill a Mockingbird\" promises to touch your heart and leave a lasting impression on your soul.\n\nUntil next time, may the spirit of Atticus Finch guide you on your journey, and may you always remember the importance of empathy, compassion, and the pursuit of justice in our world.\n\nHappy reading, my friends!",
      "likes": 1,
      "bookId": 2,
      "userId": 1,
      "id": 2
    },
    {
      "title": "Exploring the Depths of Middle-earth: My Adventure with 'The Lord of the Rings'",
      "body": "In a world where magic, friendship, and courage intertwine, J.R.R. Tolkien's masterpiece, \"The Lord of the Rings,\" takes readers on an unforgettable journey through the realms of Middle-earth. From the peaceful Shire to the fiery depths of Mount Doom, this epic saga captivates with its rich tapestry of characters and lore.  As I delved into the pages of this timeless classic, I found myself immersed in a world teeming with beauty and danger, where every turn of the page revealed new wonders and challenges. From the humble beginnings of Frodo Baggins' quest to destroy the One Ring to the epic battles that decide the fate of Middle-earth, Tolkien's masterful storytelling kept me spellbound until the very end.  But beyond its captivating plot and breathtaking landscapes, \"The Lord of the Rings\" resonates with timeless themes of friendship, sacrifice, and the triumph of good over evil. Through the trials and tribulations faced by Frodo, Sam, Aragorn, and the Fellowship, Tolkien reminds us of the power of hope and the importance of standing against darkness, no matter the odds.  In the end, \"The Lord of the Rings\" is more than just a story; it's a journey of the heart and soul, one that continues to inspire readers of all ages to embark on their own adventures and never lose sight of the light that shines in even the darkest of times.",
      "likes": 1,
      "bookId": 8,
      "userId": 1,
      "id": 3
    },
    {
      "title": "Survival and Sacrifice: Reflecting on 'The Hunger Games'",
      "body": "In a dystopian future where the odds are never in your favor, Suzanne Collins' \"The Hunger Games\" transports readers into a world where survival is not just a choice but a ruthless game of life and death. From the poverty-stricken District 12 to the opulent Capitol, this gripping tale follows the journey of Katniss Everdeen as she navigates the treacherous arena of the Hunger Games.  From the moment I picked up this book, I was captivated by its relentless pace and raw emotion. Collins paints a vivid picture of a society divided by class and hunger for power, where the spectacle of the Hunger Games serves as both entertainment and a chilling reminder of the Capitol's control over its citizens.  As Katniss fights for survival amidst the chaos of the Games, she becomes a symbol of hope and defiance, sparking a revolution that challenges the very foundation of the Capitol's tyranny. But beyond its thrilling action and suspenseful plot twists, \"The Hunger Games\" delves into themes of sacrifice, loyalty, and the resilience of the human spirit.  Through Katniss's journey, we are reminded of the power of individual agency in the face of oppression and the importance of standing up for what is right, even when the odds seem insurmountable. In a world where survival is a constant battle, \"The Hunger Games\" serves as a poignant reminder of the strength we possess when we dare to fight for a better tomorrow.",
      "likes": 0,
      "bookId": 10,
      "userId": 1,
      "id": 4
    },
    {
      "title": "A Journey Through Middle-earth: My Reflections on \"The Hobbit\"",
      "body": "Greetings, fellow adventurers! Today, I embark on a quest to share my personal reflections on J.R.R. Tolkien's timeless tale, \"The Hobbit.\" As I close the final pages of this enchanting book, I find myself transported to a world of magic, courage, and unexpected friendships.\n\n\"The Hobbit\" follows the journey of Bilbo Baggins, a hobbit who is thrust into a grand adventure beyond the comforts of his cozy home in the Shire. From the moment Gandalf the wizard and a band of dwarves arrive on his doorstep, Bilbo's life is forever changed.\n\nOne aspect of the book that captivated me from the start is Tolkien's unparalleled ability to weave a rich tapestry of mythology and folklore. As Bilbo traverses the misty mountains, encounters trolls and elves, and confronts the fearsome dragon Smaug, I found myself completely immersed in the vivid landscapes of Middle-earth.\n\nBut beyond its fantastical elements, \"The Hobbit\" is also a story about personal growth and resilience. Bilbo's journey from a timid hobbit to a brave adventurer is both inspiring and relatable. His encounters with danger and uncertainty force him to confront his own fears and discover strengths he never knew he possessed.\n\nYet amidst the epic battles and narrow escapes, it is the themes of friendship and loyalty that resonate most deeply with me. From the steadfast loyalty of Thorin Oakenshield to the unexpected bond between Bilbo and Gollum, \"The Hobbit\" reminds us that true heroism often lies in acts of compassion and selflessness.\n\nAs I reluctantly bid farewell to Bilbo and his companions, I am left with a sense of wonder and nostalgia. \"The Hobbit\" is more than just a book; it's a journey into the heart of imagination, where every page is a doorway to adventure and discovery.\n\nSo to all fellow travelers who have yet to embark on this literary quest, I urge you to set forth on your own adventure through Middle-earth. Whether you're a seasoned adventurer or a first-time traveler, \"The Hobbit\" promises to enchant and inspire, leaving an indelible mark on your heart.\n\nUntil next time, may your paths be ever filled with wonder and your adventures abound!\n\nSafe travels, my friends. ",
      "likes": 0,
      "bookId": 4,
      "userId": 2,
      "id": 5
    }
  ],
  "users": [
    {
      "id": 1,
      "fullName": "Kayce Bracewell",
      "email": "kayceb98@gmail.com",
      "isAdmin": true
    },
    {
      "email": "ahopkins@yahoo.com",
      "fullName": "Anthony Hopkins",
      "isAdmin": false,
      "id": 2
    }
  ],
  "liked": [
    {
      "id": 1,
      "userId": 1,
      "postId": 5
    }
  ]
}